import { routes } from '../router/routes.ts'

export type faq = {
    question: string;
    answer: string;
};

export const navLinks = [
    { label: "عن الشركة", to: `${routes.home}#about`, icon: '/src/assets/icons/people.svg' },
    { label: "احجز الآن", to: routes.reservation, icon: '/src/assets/icons/calender.svg' },
    { label: "تأجير معدات طبية", to: routes.medicalEquipment, icon: '/src/assets/icons/shopping.svg' },
    { label: "انضم لفريق العمل", to: routes.careers, icon: '/src/assets/icons/briefcase.svg' },
];

export const testimonials = [
    {
        name: "مدام/ عفاف",
        image: "src/assets/female-testemonial.png",
        text: "تجربتي مع بيوركير كانت رائعة! لقد ساعدوني في العثور على أفضل المنتجات للعناية بالبشرة، وكانت خدمة العملاء ممتازة. أوصي بشدة باستخدامهم لأي شخص يبحث عن منتجات عالية الجودة وموثوقة.",
    },
    {
        name: "دكتور/ ياسر",
        image: "src/assets/male-testemonial.png",
        text: "لقد كانت تجربتي مع بيوركير ممتازة! المنتجات التي اشتريتها كانت فعالة وآمنة، وخدمة العملاء كانت سريعة ومفيدة. سأستمر في التسوق معهم بالتأكيد.",
    },
    {
        name: "أستاذة/ ليلى",
        image: "src/assets/female-testemonial.png",
        text: "أنا سعيدة جدًا بتجربتي مع بيوركير! لقد وجدت منتجات رائعة للعناية بالبشرة، وكانت عملية الشراء سهلة وسريعة. أوصي بشدة بهذا المتجر لأي شخص يبحث عن منتجات عالية الجودة.",
    },
];

export const faqs: faq[] = [
    {
        question: "ما هي خدمات بيوركير؟",
        answer: "بيوركير تقدم مجموعة متنوعة من الخدمات الصحية، بما في ذلك التمريض المنزلي، زيارة الطبيب بالمنزل， رعاية كبار السن، العناية المركزة بالمنزل، التحاليل الطبية، وتغيير الجروح.",
    },
    {
        question: "كيف يمكنني حجز خدمة؟",
        answer: "يمكنك حجز خدمة من خلال زيارة صفحة الحجز على موقعنا الإلكتروني، أو الاتصال بفريق خدمة العملاء لدينا لتقديم المساعدة في الحجز.",
    },
    {
        question: "هل تقدمون خدمات في جميع المناطق؟",
        answer: "نعم، نحن نقدم خدماتنا في معظم المناطق. يرجى التواصل معنا لمعرفة ما إذا كانت خدماتنا متاحة في منطقتك.",
    },
    {
        question: "ما هي ساعات العمل؟",
        answer: "نحن نقدم خدماتنا على مدار الساعة طوال أيام الأسبوع لضمان تلبية احتياجات عملائنا في أي وقت.",
    },
    {
        question: "هل يمكنني تعديل أو إلغاء الحجز؟",
        answer: "نعم، يمكنك تعديل أو إلغاء الحجز من خلال الاتصال بفريق خدمة العملاء لدينا. يرجى ملاحظة أن هناك سياسات محددة للتعديل والإلغاء، لذا يُفضل التواصل معنا في أقرب وقت ممكن.",
    },
];